<!DOCTYPE html>
<html lang="pt-br">
<head>
    <meta charset="UTF-8">

    <!-- Bootstrap -->
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css" rel="stylesheet">
    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/js/bootstrap.bundle.min.js"></script>

    <!-- esrtilos personalizados -->
    <link href="assets/css/style.css" rel="stylesheet">

    <!-- scripts personalizados -->
    <script src="assets/js/paginar.js"></script>

    <title>Caderno de Receitas</title>

</head>
<body>

    <div class="main">
        <div class="row">

            <div id="pag1" class="item col-12 active">
                <h2>Rabanete Grelhado</h2>

                <img src="assets/images/receita-1.webp" alt="Rabanete Grelhado" title="Rabanete Grelhado"
                     class="mt-4">

                <p class="mt-3 font-bold subtitulo">INGREDIENTES</p>

                <ul>
                    <li>1 ma&ccedil;o de rabanete (cerca de 15 unidades)</li>
                    <li>2 colheres de ch&aacute; de azeite</li>
                    <li>Sal a gosto</li>
                    <li>Pimenta-do-reino mo&iacute;da na hora a gosto
                    </li>
                </ul>

                <p class="mt-3 font-bold subtitulo">MODO DE PREPARO</p>

                <ol type="number">
                    <li>
                        Mantenha um pedaço do cabinho e lave os rabanetes com uma escovinha para legumes
                        sob &aacute;gua corrente. Seque os rabanetes com um pano de prato - quanto mais sequinhos
                        estiverem, melhor para grelhar, pois o azeite n&atilde;o vai espirrar na frigideira.
                    </li>
                    <li>
                        Corte os rabanetes ao meio; se estiverem muito grandes, corte em quartos.
                    </li>
                    <li>
                        Leve uma frigideira grande, de prefer&ecirc;ncia antiaderente, ao fogo m&eacute;dio. Quando
                        aquecer, regue com 1 colher de ch&aacute; de azeite e coloque metade dos rabanetes para
                        grelhar, com a parte cortada para baixo, um ao lado do outro, sem amontoar. Deixe dourar
                        por cerca de 2 minutos e vire com uma pinça para dourar o outro lado por igual.
                    </li>
                    <li>
                        Transfira os rabanetes dourados para um prato e tempere com sal e pimenta a gosto.
                        Repita o processo com a outra metade, regando a frigideira com o restante do azeite.
                        Sirva a seguir.
                    </li>
                </ol>
            </div> <!-- /Receita 1 -->

            <div id="pag2" class="item col-12">
                <h2>Fil&eacute; de frango marinado com laranja e alecrim</h2>

                <img src="assets/images/receita-1.webp" alt="Fil&eacute; de frango marinado com laranja e alecrim"
                     title="Fil&eacute; de frango marinado com laranja e alecrim" class="mt-4">

                <p class="mt-3 font-bold subtitulo">INGREDIENTES</p>

                <ul>
                    <li>2 fil&eacute;s de peito de frango</li>
                    <li>1 x&iacute;cara de ch&aacute; de caldo de laranja coado</li>
                    <li>2 colheres de sopa de azeite</li>
                    <li>1 dente de alho</li>
                    <li>2 colheres de ch&aacute; de amido de milho</li>
                    <li>1 ramo de alecrim fresco</li>
                    <li>Sal a gosto</li>
                    <li>Pimenta-do-reino mo&iacute;da na hora</li>
                </ul>

                <p class="mt-3 font-bold subtitulo">MODO DE PREPARO</p>

                <ol type="number">
                    <li>
                        Com a lateral da l&acirc;mina da faca, amasse o dente de alho e descasque.
                    </li>
                    <li>
                        Em uma tigela, coloque o alho, o alecrim, o caldo de laranja, 1 colher de sopa de
                        azeite e misture. Mergulhe os fil&eacute;s de frango, tampe e deixe marinar por
                        20 minutos em temperatura ambiente.
                    </li>
                    <li>
                        Passado o tempo da marinada, com uma pin&ccedil;a, transfira os fil&eacute;s de frango
                        para um prato - deixe escorrer bem o l&iacute;quido da marinada e seque os fil&eacute;s
                        com papel-toalha.
                    </li>
                    <li>
                        Leve uma frigideira grande ao fogo m&eacute;dio. Quando aquecer, regue com 1 colher de
                        sopa de azeite. Tempere os fil&eacute;s de frango com sal e coloque um ao lado do outro
                        na frigideira, com a parte de cima (a mais lisinha) em contato com o fundo.
                    </li>
                    <li>
                        Deixe dourar por 2 minutos de cada lado e abaixe o fogo - esse processo vai selar a carne
                        e manter o fil&eacute; suculento.
                    </li>
                    <li>
                        Abaixe o fogo e deixe o fil&eacute; de frango terminar de cozinhar por mais 3 minutos de
                        cada lado. Atenção: o tempo pode variar dependendo do tamanho e da espessura do fil&eacute;,
                        e o fogo tem que estar baixo mesmo, do contr&aacute;rio a carne queima por fora e fica crua
                        por dentro.
                    </li>
                    <li>
                        Enquanto isso, dissolva o amido de milho no l&iacute;quido da marinada e tempere com uma
                        pitada de sal e uma de pimenta - esse l&acute;quido vai virar o molho do fil&eacute; de frango.
                    </li>
                    <li>
                        Transfira os fil&eacute;s dourados para um prato e mantenha a frigideira em fogo baixo. Regue
                        com o l&iacute;quido da marinada de uma s&oacute; vez (com o alho e o alecrim) e, com uma
                        esp&aacute;tula de silicone, raspe bem o fundo da frigideira para dissolver os queimadinhos -
                        eles d&atilde;o mais sabor ao molho.
                    </li>
                    <li>
                        Continue mexendo em fogo baixo por cerca de 3 minutos, at&eacute; formar um molho levemente
                        espesso.
                    </li>
                    <li>
                        Transfira o molho para uma tigela (ou molheira) passando por uma peneira. Sirva os fil&eacute;s
                        de frango com o molho.
                    </li>
                </ol>
            </div> <!-- /Receita 2 -->

            <div id="pag3" class="item col-12">
                <h2>Pudim de leite com furinhos</h2>

                <img src="assets/images/receita-1.webp" alt="Pudim de leite com furinhos"
                     title="Pudim de leite com furinhos" class="mt-4">

                <p class="mt-3 font-bold subtitulo">INGREDIENTES (CALDA)</p>

                <ul>
                    <li>1 x&iacute;cara de ch&aacute; de a&ccedil;&uacute;car</li>
                    <li>Um ter&ccedil;o de x&iacute;cara de ch&aacute; de &aacute;gua fervente</li>
                </ul>

                <p class="mt-3 font-bold subtitulo">INGREDIENTES (PUDIM)</p>

                <ul>
                    <li>1 lata de leite condensado</li>
                    <li>4 ovos</li>
                    <li>2 e meia x&iacute;caras de ch&aacute; de leite</li>
                </ul>

                <p class="mt-3 font-bold subtitulo">MODO DE PREPARO</p>

                <ol type="number">
                    <li>
                        Separe uma forma redonda de 22 cent&iacute;metros de di&acirc;metro com furo no meio. Leve
                        uma chaleira com 3 x&iacute;caras de ch&aacute; de &aacute;gua ao fogo m&eacute;dio - ela
                        vai ser usada para fazer a calda e assar o pudim em banho-maria.
                    </li>
                    <li>
                        Em uma panela m&eacute;dia de borda alta, leve o a&ccedil;&uacute;car ao fogo baixo para
                        derreter, mexendo com uma esp&aacute;tula de silicone, at&eacute; formar um caramelo dourado.
                    </li>
                    <li>
                        Me&ccedil;a um ter&ccedil;o de x&iacute;cara de ch&aacute; da &aacute;gua fervente e, com
                        cuidado, regue o caramelo. Atenção: a calda vai borbulhar. Misture com a esp&aacute;tula
                        at&eacute; ficar lisa.
                    </li>
                    <li>
                        Transfira a calda para a forma, vertendo sobre o cone central.
                    </li>
                    <li>
                        Com um pano de prato ou uma luva t&eacute;rmica, segure e gire a forma para caramelizar
                        tamb&eacute;m a lateral. Reserve.
                    </li>
                </ol>
            </div> <!-- /Receita 3 -->

            <div class="mt-5">
                <nav>
                    <ul class="pagination pagination-sm">
                        <li id="p1" class="page-item active">
                            <a class="page-link" href="#" title="P&aacute;gina 1" onclick="Paginar('pag1')">1</a>
                        </li>
                        <li id="p2" class="page-item">
                            <a class="page-link" href="#" title="P&aacute;gina 2" onclick="Paginar('pag2')">2</a>
                        </li>
                        <li id="p3" class="page-item">
                            <a class="page-link" href="#" title="P&aacute;gina 3" onclick="Paginar('pag3')">3</a>
                        </li>
                    </ul>
                </nav>
            </div>

        </div>
    </div> <!-- /main -->

</body>
</html>